# Завдання 1. Безпечний калькулятор — 2 б.
# Користувач вводить два числа та операцію +, -, *, /. Програма повинна виконати обчислення й не
# завершуватися аварійно при неправильних даних.
# Обробіть: нечислове введення; ділення на нуль; невідому операцію. Для кожної ситуації виводьте
# зрозуміле повідомлення.
t = True
while t:
    try:
        a = float(input("Введіть перше число: "))
        t = False
    except ValueError:
        print("Нечислове введення! Повторіть введення")

t = True
while t:
    try:
        b = float(input("Введіть друге число: "))
        t = False
    except ValueError:
        print("Нечислове введення! Повторіть введення")

znak = "*-+/"
t = True
while t:
    z = input("Введіть знак операції ( * - + / ) : ")
    if len(z) == 1 and z[0] in znak:
        t = False
    else:
        print("Невідома операція! повторіть введення")
if z == "*":
    print(f" {a} * {b} = ", a*b)

if z == "-":
    print(f" {a} - {b} = ", a - b)

if z == "+":
    print(f" {a} + {b} = ", a + b)

try:
    if z == "/":
        print(f" {a} / {b} = ", a / b)
except ZeroDivisionError:
       print("Ділення на нуль! Не можна ділити на нуль, вивчи йомайо!")

# Завдання 2. Надійне введення оцінки — 2 б.
# Створіть функцію input_grade(), яка повторює введення, доки користувач не введе ціле число від 1 до 12.
# Якщо число поза діапазоном — самостійно викликайте ValueError через raise.
# Функція повинна повернути коректну оцінку. Програма не повинна завершуватися після першої помилки.
def input_grade():
    k = True
    while k:
        try:
            grade = int(input("Введіть ціле число від 1 до 12: "))
            k = False
            if grade < 1 or grade > 12:
                raise ValueError("Оцінка має бути від 1 до 12")
            return grade
        except ValueError as error:
            print(error)
m_grade = input_grade()
print(f"Введена оцінка {m_grade}")

# Завдання 3. Безпечний пошук у колекціях — 3 б.
# Створіть список учнів та словник «предмет → оцінка». Користувач обирає тип пошуку: 1 — учень за
# індексом; 2 — оцінка за назвою предмета.
# Для списку обробіть нечисловий індекс та IndexError. Для словника — KeyError. Для невідомого пункту
# меню виведіть окреме повідомлення. Програма повинна пояснювати, що саме введено неправильно.

sy = ["Олександра", "Герман", "Марго", "Тарас", "Микола"]
ocin = {
    "Математика": 7,
    "Історія": 10,
    "Англійська": 12,
    "Інформатика": 8,
    "Біологія": 6
}

p = True
while p:
    try:
        typ = int(input("Введіть тип пошуку 1 — учень за індексом; 2 — оцінка за назвою предмета: "))

        if typ < 1 or typ > 2:
            raise ValueError("тип пошуку 1 — учень за індексом; 2 — оцінка за назвою предмета!")

        p = False
    except ValueError as error:
        print("Введено не правильне значення")

if typ == 1:
    print(f"\nУ списку учнів: {len(sy)}. Можна використати індекси від 0 до {len(sy) - 1}.")

    p = True
    while p:
        try:
            uch = int(input("Введіть індекс учня: "))

            if uch < 0 or uch > (len(sy) - 1):
                raise ValueError(f"Введення невірно! Можна використати індекси від 0 до {len(sy) - 1}")
            p = False
        except ValueError as error:
            print("Введено не правильне значення, має бути цифра у діапазоні індекса")
    print(sy[uch])

if typ == 2:

    p = True
    while p:

            print(f"\nПредмети: {ocin.keys()}")
            pred = (input("Введіть назву предмета: "))
            try:
                if ocin[pred]:
                    p = False
            except KeyError:
                print("Такий предмет не знайдено. введіть правильний.")
    print(f"Результат: З предмета «{pred}» отримана оцінка {ocin[pred]}.")

# Завдання 4. Надійна обробка файлу студентів — 5 б.
# Файл students.txt містить записи у форматі «Прізвище Ім'я;Бал». Програма повинна прочитати файл і
# сформувати report.txt лише з правильних записів.
# Передбачте такі проблеми: файл students.txt відсутній; у рядку немає роздільника «;» або кількість полів
# неправильна; бал не є цілим числом; бал знаходиться поза діапазоном 0..100.
# Неправильний рядок потрібно пропустити, але вивести повідомлення з номером рядка та причиною.
# Правильні записи зберегти, відсортувати за балом від більшого до меншого та записати у report.txt.
# Наприкінці вивести кількість правильних і пропущених записів.
# Вимога: використовуйте FileNotFoundError, ValueError та перевірку структури рядка. Не використовувати
# except: pass.
res=[]
try:
    with open('students.txt', 'r', encoding="utf-8") as file:
        k = 0
        kp = 0
        knp = 0
        for line in file:
            s = line.strip()
            strob = s.split(";")
            k = k + 1

            if len(strob) == 1:
                print(f"У рядку № {k} немає роздільника «;»: {strob}")
                knp +=1
            if len(strob) > 2:
                print(f"У рядку № {k} кількість полів неправильна: {strob}")
                knp +=1
            if len(strob) == 2:
                try:
                    ocin = int(strob[1])
                    if ocin > 100 or ocin < 0:
                        knp += 1
                        print(f"У рядку № {k} бал знаходиться поза діапазоном 0..100: {strob}")
                    else:
                        res.append(strob)
                        kp += 1
                except ValueError:
                    print(f"У рядку № {k} бал не є цілим числом: {strob}")
                    knp += 1



    print("Правильних строк: ", kp)
    print("Неправильних строк: ", knp)
    print("Всього обработано строк: ",k)
    ress = sorted(res, key=lambda x: x[1], reverse=True)
    with open('report.txt', 'w', encoding="utf-8") as file4 :
        for line in ress:
            file4.write(f"{line[0]};{line[1]}\n")
except FileNotFoundError as error:
    print("Файл students.txt відсутній")













